Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
sponse" "vcfstats-patch" {
        id                  = "agir-osb9nvt4q0-pthst5-PATCH-200"
      + response_parameters = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-post has changed
  ~ resource "aws_api_gateway_integration_response" "vcfstats-post" {
        id                  = "agir-osb9nvt4q0-pthst5-POST-200"
      + response_parameters = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.cognito.aws_cognito_user.admin will be created
  + resource "aws_cognito_user" "admin" {
      + attributes            = {
          + "email"          = "admin@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Admin"
          + "given_name"     = "Admin"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = "ap-southeast-3_aosNqJwGI"
      + username              = "admin@example.com"
    }

  # module.cognito.aws_cognito_user.guest will be created
  + resource "aws_cognito_user" "guest" {
      + attributes            = {
          + "email"          = "guest@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Guest"
          + "given_name"     = "Guest"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = "ap-southeast-3_aosNqJwGI"
      + username              = "guest@example.com"
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + user_pool_id = "ap-southeast-3_aosNqJwGI"
      + username     = "admin@example.com"
    }

  # module.sbeacon.aws_api_gateway_deployment.BeaconApi (deposed object aa4e5a3c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "BeaconApi" {
      - created_date  = "2025-05-26T05:50:25Z" -> null
      - execution_arn = "arn:aws:execute-api:ap-southeast-3:565393035713:ay7zxbuce5/" -> null
      - id            = "ezblap" -> null
      - invoke_url    = "https://ay7zxbuce5.execute-api.ap-southeast-3.amazonaws.com/" -> null
      - rest_api_id   = "ay7zxbuce5" -> null
      - triggers      = {
          - "redeployment" = "3c12904e5316c5a0507c5f5463244892471c172b"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_binaries_layer:1" -> (known after apply)
      ~ code_sha256                 = "YSZEp3T8ccgiQBFvuf1s3zOXZRcfGyw6wwC4cTSXQ90=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-26T05:48:06.753+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_binaries_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Jvk3NXSt6xOScS6yj2ROm8MiXO+qY+AFyA9fMdKxA4PL5ApX2b+WtTss/jRbKOmZ+MjsIEJtqLSQdNrfdshBxg==" -> "N7ANW8zaiOW1xbZXwrWFTIkmz8TziojpEfdH6sSndPux/DjmZN/R10NCMoOHDHkXglfbBEM7W8SUy15dKQTvxg==" # forces replacement
      ~ source_code_size            = 18422802 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_deployment.VPApi must be replaced
+/- resource "aws_api_gateway_deployment" "VPApi" {
      ~ created_date  = "2025-05-26T08:36:28Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ap-southeast-3:565393035713:osb9nvt4q0/" -> (known after apply)
      ~ id            = "35ztqv" -> (known after apply)
      ~ invoke_url    = "https://osb9nvt4q0.execute-api.ap-southeast-3.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "8c10a7972a664f7766ec9f4b1b325ba368683c66" -> "4384d90f37d419c0c2396e6de7f5ed012b5f1b74"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].aws_api_gateway_stage.VPApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "VPApi" {
      ~ deployment_id         = "35ztqv" -> (known after apply)
        id                    = "ags-osb9nvt4q0-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].aws_cloudfront_distribution.api_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "api_distribution" {
        id                              = "E1ZQVRVA84LBB3"
        tags                            = {}
        # (23 unchanged attributes hidden)

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "osb9nvt4q0.execute-api.ap-southeast-3.amazonaws.com" -> null
          - origin_id                = "svep-backend-api" -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "https-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "svep-backend-api"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer:1" -> (known after apply)
      ~ code_sha256                 = "3gJhTdWrjFZ+EtAD3a2yjlRHzzIqwXbKier7MONQgvE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-26T05:42:08.934+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "qqJA8uRdDIDg/CJA3WLxa7ajb/XbfyN2N68R1P6xfVDk+H89/xJranWL+Kt78EUqVfYStVMstk76MU7A4Q5Adw==" -> "YRzBhQozVYx09Anr53vK3J1AgEF7It16rw0CxeVkj9HFjs5/xnp05duBZIc5e6LkO3HD30p64Upggawn/Xfldw==" # forces replacement
      ~ source_code_size            = 17951330 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate will be created
  + resource "null_resource" "cloudfront-invalidate" {
      + id       = (known after apply)
      + triggers = {
          + "compiled_code_hash" = "eb8e638f5b192a20c8fb0fb9a7b2f14e9c43634a"
        }
    }

  # module.webgui.null_resource.s3-upload will be created
  + resource "null_resource" "s3-upload" {
      + id       = (known after apply)
      + triggers = {
          + "build_file_hash"    = "892f738d6a75c9a463120bba9ae1147b02f43b74"
          + "compiled_code_hash" = "eb8e638f5b192a20c8fb0fb9a7b2f14e9c43634a"
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6589629704975215654" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236575633260000" -> "1748304932737613000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1259770648525927297" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236575493237000" -> "1748304931129179000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "650370161442721717" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236574476006000" -> "1748304931372755000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1567682636290095481" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236575313978000" -> "1748304930149292000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:22e580b25ea00e0298c7a0dd06b38646248f25316794490bc6ad31edf0e7f93f565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:22e580b25ea00e0298c7a0dd06b38646248f25316794490bc6ad31edf0e7f93f" -> (known after apply)
        name         = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:babf4a1274c4197f9afe3e835b76cd3dcbd7c84fefa6f734b899bfdd3d66d2be" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "8566e8f0a164dfe7238d4ed142f95cce4b911a04" -> "48651707bbe661768604481257bef85fd631382f"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:babf4a1274c4197f9afe3e835b76cd3dcbd7c84fefa6f734b899bfdd3d66d2be" -> (known after apply)
        name                 = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:babf4a1274c4197f9afe3e835b76cd3dcbd7c84fefa6f734b899bfdd3d66d2be" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "8566e8f0a164dfe7238d4ed142f95cce4b911a04" -> "48651707bbe661768604481257bef85fd631382f"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-admin"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2759537244411799304" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236576175846000" -> "1748304931762362000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-dataPortal"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2725401405195344447" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236573901273000" -> "1748304931258259000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2152608599886264996" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236574380189800" -> "1748304931942178000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_binaries_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "728748652992291954" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236576317875000" -> "1748304931550523000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5047453480961646076" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236574527134800" -> "1748304932040605000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5728966329847483163" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236575491486000" -> "1748304931844271000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "962278290080075009" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236576406751000" -> "1748304932673143000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3336638380266700818" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236575203123000" -> "1748304930679128800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3538551375577866471" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236574705617000" -> "1748304931531827000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2000387244737534444" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236576092205000" -> "1748304931853470000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7117452057968086335" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236576210306000" -> "1748304931471828000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3237930709230737983" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236574773423000" -> "1748304932722631000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4936170995472444455" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236573794614000" -> "1748304931722372000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3899444224407452376" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236574340054000" -> "1748304931320561000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1154229296290052145" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236575693111800" -> "1748304933349332000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "483330852600825276" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236573884347000" -> "1748304931961201000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3203848647317394809" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236574741460000" -> "1748304932044416000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8973929817397042493" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236576243491800" -> "1748304931923683000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8113807433747530307" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236574933230000" -> "1748304931935684000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6671997148044968396" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236574436032000" -> "1748304931339131200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:babf4a1274c4197f9afe3e835b76cd3dcbd7c84fefa6f734b899bfdd3d66d2be" -> (known after apply)
      ~ last_modified                  = "2025-05-26T05:23:53.744+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2360510661939507175" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236575513230000" -> "1748304931419203000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1" -> (known after apply)
      ~ code_sha256                 = "2axoLD3PBkp8J0AbnAOfZZ2u6tCAIcXUvOnOXInheT8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-26T05:48:10.730+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:565393035713:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/a3c28b5f90c11cb4a7a8604bff4d0d633db89dc1e3ee0ddc737587550575c6a4.zip" -> "builds/e37191796069fa668481b38302942006f18cf40d82d11eaea1038ac2b35efd01.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23518031 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250526051653216100000002/builds/a3c28b5f90c11cb4a7a8604bff4d0d633db89dc1e3ee0ddc737587550575c6a4.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "90b9c13c46e941bc4a923a60b3cc2e00-5" -> (known after apply)
      ~ id                            = "builds/a3c28b5f90c11cb4a7a8604bff4d0d633db89dc1e3ee0ddc737587550575c6a4.zip" -> (known after apply)
      ~ key                           = "builds/a3c28b5f90c11cb4a7a8604bff4d0d633db89dc1e3ee0ddc737587550575c6a4.zip" -> "builds/e37191796069fa668481b38302942006f18cf40d82d11eaea1038ac2b35efd01.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/a3c28b5f90c11cb4a7a8604bff4d0d633db89dc1e3ee0ddc737587550575c6a4.zip" -> "builds/e37191796069fa668481b38302942006f18cf40d82d11eaea1038ac2b35efd01.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/e37191796069fa668481b38302942006f18cf40d82d11eaea1038ac2b35efd01.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e37191796069fa668481b38302942006f18cf40d82d11eaea1038ac2b35efd01.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1971425559090052572" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a3c28b5f90c11cb4a7a8604bff4d0d633db89dc1e3ee0ddc737587550575c6a4.zip" -> "builds/e37191796069fa668481b38302942006f18cf40d82d11eaea1038ac2b35efd01.zip"
          ~ "timestamp" = "1748238480391738000" -> "1748304949033742000"
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "190948259133036157" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236575386904000" -> "1748304931326608800"
            # (1 unchanged element hidden)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "432309256429861981" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236575203890000" -> "1748304930772003800"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e" -> (known after apply)
        name         = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ repo_digest  = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "605dd759e6aacc8bbb7a0c9c5eb11d23fafb2f5f" -> "e396e46fb61a2d56523dc7fb60c4f6166de4eb10"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
        name                 = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "605dd759e6aacc8bbb7a0c9c5eb11d23fafb2f5f" -> "e396e46fb61a2d56523dc7fb60c4f6166de4eb10"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:92abf6a4ed3db54cd79b77853f26a7efe55fe2c86936de14dfc9afc3551e5d8f565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:92abf6a4ed3db54cd79b77853f26a7efe55fe2c86936de14dfc9afc3551e5d8f" -> (known after apply)
        name         = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ repo_digest  = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:751eef6c076559f6a46f53d5532c85e4215ab05e48cac4247d8c8771e0ab2c9f" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "5a0b4d77ab9cc80eb83f4203a33bfe2342adeb3a" -> "60fe5a1fb5e1f34d02226780e2cd14e85a9d497a"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:751eef6c076559f6a46f53d5532c85e4215ab05e48cac4247d8c8771e0ab2c9f" -> (known after apply)
        name                 = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:751eef6c076559f6a46f53d5532c85e4215ab05e48cac4247d8c8771e0ab2c9f" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "5a0b4d77ab9cc80eb83f4203a33bfe2342adeb3a" -> "60fe5a1fb5e1f34d02226780e2cd14e85a9d497a"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6023276117658534292" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236581017651000" -> "1748304931059134000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-initQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginClinvar"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:bc517e5d30ebe6fd85479439ddb161491ac105cc7e5cabf88381d8c185cc56af" -> (known after apply)
      ~ last_modified                  = "2025-05-26T05:23:59.230+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-pluginGnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "565393035713.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:751eef6c076559f6a46f53d5532c85e4215ab05e48cac4247d8c8771e0ab2c9f" -> (known after apply)
      ~ last_modified                  = "2025-05-26T08:35:47.654+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryGTF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-queryVCF"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_binaries_layer:1",
          - "arn:aws:lambda:ap-southeast-3:565393035713:layer:svep_backend_python_modules_layer:1",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "586897047197275159" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236580946966800" -> "1748304930846536000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3485983597848801941" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748236581090882000" -> "1748304930237305000"
            # (1 unchanged element hidden)
        }
    }

Plan: 48 to add, 32 to change, 43 to destroy.
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-data-portal.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0]: Creating...
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Creating...
module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0]: Provisioning with 'local-exec'...
module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/cognito.lambda-sendSvepJobEmail/package.py" "build" "--timestamp" "1748304930149292000" "builds/f00729ca828cf79173cf8646dad9fddc75d5d5589896998bf585d9371dbe7ceb.plan.json"]
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-getEntryTypes/package.py" "build" "--timestamp" "1748304931853470000" "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.plan.json"]
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/svep.lambda-updateReferenceFiles/package.py" "build" "--timestamp" "1748304930846536000" "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.plan.json"]
module.sbeacon.module.lambda-data-portal.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-data-portal.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-data-portal/package.py" "build" "--timestamp" "1748304931258259000" "builds/4b8981152d7b14a64376cd5830a8e4e4e3bf673ab2285e463b5d8c44c9050860.plan.json"]
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0]: Provisioning with 'local-exec'...
module.svep[0].module.lambda-clearTempAndRegions.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/svep.lambda-clearTempAndRegions/package.py" "build" "--timestamp" "1748304931059134000" "builds/182d95127e35ef0ee95ece0b03164e0fc7330b1689695ca8406ffb04a47b412b.plan.json"]
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Creating...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0]: Provisioning with 'local-exec'...
module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (local-exec): Executing: ["python3" ".terraform/modules/sbeacon.lambda-performQuery/package.py" "build" "--timestamp" "1748304931935684000" "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.plan.json"]
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: creating 'builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip' archive
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding content of directory: /atlantis/data/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/svep/lambda/updateReferenceFiles
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar.sh
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: clinvar_xmltobed.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: ensembl.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] (local-exec): zip: adding: lambda_function.py
module.svep[0].module.lambda-updateReferenceFiles.null_resource.archiv
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.